public/Roadmap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-07 Wed 17:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vision Technical Roadmap</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="theme/rethink.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Vision Technical Roadmap</h1>

<div id="outline-container-org1479df9" class="outline-2">
<h2 id="org1479df9">Roadmap <code>[1/8]</code></h2>
<div class="outline-text-2" id="text-org1479df9">
</div>
<div id="outline-container-orgbe58208" class="outline-3">
<h3 id="orgbe58208"><span class="done DONE">DONE</span> Beacon DAO <code>[2/2]</code></h3>
<div class="outline-text-3" id="text-orgbe58208">
<p>
The <b>Beacon DAO</b> is a decentralized autonomous organization implementing the Vision DAO, and a basic system for "bootstrapping" user applications from a minimal starting point. This means that a bare, basic implementation of the <b>Beacon DAO</b> can be released to the public, and be upgraded without any intervention, over time.
</p>

<ul class="org-ul">
<li><i>ETA: Mid-July</i></li>
<li>Assignee: <b>Dowland Aiello</b></li>
<li>See the <a href="phases/BeaconDAO.html#org8b8fc9c">roadmap</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org9632d7c" class="outline-3">
<h3 id="org9632d7c"><span class="todo TODO">TODO</span> Vision Virtual Machine (<code>VVM</code>) <code>[2/4]</code></h3>
<div class="outline-text-3" id="text-org9632d7c">
<p>
The Vision Virtual Machine is a module for the <b>Beacon DAO</b> that allows for general computation, and execution of arbitrary code with access to a limited, event-driven API for system-call-like functionality.
</p>

<ul class="org-ul">
<li><i>ETA: Early-December</i></li>
<li>Assignee: <b>Dowland Aiello</b>, <b>Lawrence Qupty</b></li>
<li>See the <a href="phases/VVM.html#org561e007">roadmap</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org133c9c2" class="outline-3">
<h3 id="org133c9c2"><span class="todo TODO">TODO</span> Vision Operating System <code>[0/10]</code></h3>
<div class="outline-text-3" id="text-org133c9c2">
<p>
The Vision Operating System constitutes all of the major baseline features that are necessary for Vision end-users to begin operating DAO's and developing Vision applications on the platform.
</p>

<ul class="org-ul">
<li><i>ETA: Late-December</i></li>
<li>Assignee: <b>Dowland Aiello</b>, <b>Lawrence Qutpy</b></li>
<li>See the <a href="phases/VisionOS.html#org86f4ce1">roadmap</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org692bf97" class="outline-3">
<h3 id="org692bf97"><span class="todo TODO">TODO</span> Ecosystem Features <code>[0/4]</code></h3>
<div class="outline-text-3" id="text-org692bf97">
<p>
Modules that implement important qualify-of-life features, and features that will greatly increase the growth rate of the Vision ecosystem by lowering barriers to entry, and enhancing the Vision experience overall.
</p>

<ul class="org-ul">
<li><i>ETA: January</i></li>
<li>See the <a href="phases/Ecosystem.html#orge225b75">roadmap</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-orge50e6be" class="outline-3">
<h3 id="orge50e6be"><span class="todo TODO">TODO</span> Private Test Net <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-orge50e6be">
<p>
Vision's test-net release will be gradually rolled out in two phases: a private test-net release, and a public test-net release. The former will be largely closed-source, operate in a sandboxed environment, and be accessible to only trusted partners.
</p>

<ul class="org-ul">
<li><i>ETA: January</i></li>
<li>See the <a href="phases/PrivateTestnet.html#org047e862">roadmap</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org7e8a973" class="outline-3">
<h3 id="org7e8a973"><span class="todo TODO">TODO</span> Public Test Net <code>[0/4]</code></h3>
<div class="outline-text-3" id="text-org7e8a973">
<ul class="org-ul">
<li><i>ETA: Q2 2023</i></li>
<li>See the <a href="phases/PublicTestnet.html#org4460c0c">roadmap</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb19418f" class="outline-3">
<h3 id="orgb19418f"><span class="todo TODO">TODO</span> Public Main Net <code>[0/3]</code></h3>
<div class="outline-text-3" id="text-orgb19418f">
<ul class="org-ul">
<li><i>ETA: Q3 2023</i></li>
<li>See the <a href="phases/Mainnet.html#org2f935cd">roadmap</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-orga6b639d" class="outline-3">
<h3 id="orga6b639d"><span class="todo TODO">TODO</span> Post-Release <code>[0/5]</code></h3>
<div class="outline-text-3" id="text-orga6b639d">
<p>
General goals for Vision DAO after its mainnet release, including strategies for decentralizing, and desired partnerships.
</p>

<ul class="org-ul">
<li><i>ETA: Q4 2023</i></li>
<li>See the <a href="phases/PostRelease.html#org93cc0ec">roadmap</a>.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 06/19/2022</p>
<p class="date">Created: 2022-12-07 Wed 17:13</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
